export const mockComments = [
  {
    positiveText: 'Очень качественные наушники, звук просто шикарный!',
    negativeText: null,
    neutralText: 'Наушники немного тяжеловаты для длительного ношения.',
    type: 'product',
  },
  {
    positiveText: 'Отличная скидка, купил товар по очень хорошей цене.',
    negativeText: null,
    neutralText: 'Ожидание доставки было немного долгим.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText: 'Кухня не совсем оправдала ожидания, еда не была горячей.',
    neutralText:
      'Ресторан сам по себе уютный, но не самое лучшее место для ужина.',
    type: 'place',
  },
  {
    positiveText: 'Очень удобный и стильный рюкзак, много карманов.',
    negativeText: null,
    neutralText: 'Легкий и долговечный, но немного жестковат.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText:
      'Долго искал сантехника, а когда он пришел — оказалось, что не все инструменты были с собой.',
    neutralText: 'Ремонт занял больше времени, чем ожидалось.',
    type: 'service',
  },
  {
    positiveText: 'Прекрасный сервис, очень вежливые сотрудники.',
    negativeText: 'Цены могли бы быть немного ниже.',
    neutralText: 'Идеально подходит для быстрого решения проблем.',
    type: 'service',
  },
  {
    positiveText:
      'Очень удобное кресло, спина не устает даже после долгого сидения.',
    negativeText: null,
    neutralText: 'Цвет немного отличается от того, что был на картинке.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText: 'Магазин, где часто бывают проблемы с возвратом товаров.',
    neutralText: 'Продавцы вежливые, но не всегда компетентные.',
    type: 'place',
  },
  {
    positiveText:
      'Очень вкусные пироги, идеально подходят для семейных посиделок.',
    negativeText: 'Немного высокие цены для такого формата кафе.',
    neutralText: 'Место удобно расположено и не так много народу.',
    type: 'place',
  },
  {
    positiveText: 'Мой компьютер работает на ура после ремонта!',
    negativeText: null,
    neutralText: 'Мастер заменил все детали быстро и без нареканий.',
    type: 'service',
  },
  {
    positiveText:
      'Прекрасное качество фотоаппарата, очень нравится съемка при низком освещении.',
    negativeText: null,
    neutralText:
      'Камера стоит своих денег, но не хватает некоторых дополнительных функций.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText: 'Прислали не тот товар.',
    neutralText: 'Обслуживание достаточно вежливое, но часто бывают ошибки.',
    type: 'product',
  },
  {
    positiveText: 'Очень хорошая кофемашина, кофе получается идеально.',
    negativeText: null,
    neutralText: 'Машина достаточно громкая при приготовлении.',
    type: 'product',
  },
  {
    positiveText: 'Ремонт в срок и без лишних хлопот, мастера — профессионалы.',
    negativeText: null,
    neutralText:
      'Все сделали как надо, но небольшие детали оставили без внимания.',
    type: 'service',
  },
  {
    positiveText: 'Это просто находка! Легкий и компактный зарядный блок.',
    negativeText: null,
    neutralText:
      'Заряжает быстро, но плохо держит заряд в долгосрочной перспективе.',
    type: 'product',
  },
  {
    positiveText: 'Очень хороший холодильник, много места для продуктов.',
    negativeText: 'Довольно шумный при работе.',
    neutralText: 'Холодильник большой, подходит для семьи.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText: 'Не все товары соответствуют описанию.',
    neutralText: 'Магазин имеет хорошие цены, но с качеством есть вопросы.',
    type: 'place',
  },
  {
    positiveText:
      'Очень уютное место для работы, есть отдельные кабинеты для встреч.',
    negativeText: 'Интернет иногда подводит.',
    neutralText: 'Прекрасное место для удаленной работы.',
    type: 'place',
  },
  {
    positiveText: 'Хороший холодильник, работает тихо и надежно.',
    negativeText: null,
    neutralText: 'Размеры немного не подходят для моей кухни.',
    type: 'product',
  },
  {
    positiveText: 'Сантехник сделал все быстро и качественно.',
    negativeText: 'Но за услугу взяли больше, чем было договорено.',
    neutralText:
      'Работу сделали на хорошем уровне, но есть вопросы по стоимости.',
    type: 'service',
  },
  {
    positiveText: 'Потрясающий вкус, ресторанный уровень.',
    negativeText: 'Цены немного завышены для такого места.',
    neutralText: 'Очень хорошая кухня и вежливое обслуживание.',
    type: 'place',
  },
  {
    positiveText:
      'Прекрасное качество этого кресла! Очень комфортно сидеть целый день.',
    negativeText: null,
    neutralText:
      'Покрытие немного царапается, но это не сильно влияет на использование.',
    type: 'product',
  },
  {
    positiveText:
      'Качество обслуживания на высоте, приятно, когда к тебе прислушиваются.',
    negativeText: null,
    neutralText:
      'Ресторан на хорошем уровне, но иногда приходится ждать столик.',
    type: 'place',
  },
  {
    positiveText: null,
    negativeText:
      'Цена за услуги ремонта была значительно завышена по сравнению с рыночными.',
    neutralText:
      'Работа сделана аккуратно, но стоит слишком дорого для такого типа услуг.',
    type: 'service',
  },
  {
    positiveText: 'Отличный ноутбук, быстрый и удобный.',
    negativeText: null,
    neutralText: 'Вентилятор немного шумит, но это не мешает работать.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText:
      'Это кафе обслуживает очень медленно, пришлось ждать слишком долго.',
    neutralText:
      'Интерьер довольно приятный, но обслуживание оставляет желать лучшего.',
    type: 'place',
  },
  {
    positiveText:
      'Очень удобные и легкие кроссовки, идеально подходят для пробежек.',
    negativeText: null,
    neutralText:
      'Скоро проверю, насколько они долговечны при регулярных тренировках.',
    type: 'product',
  },
  {
    positiveText: null,
    negativeText:
      'Неправильно установили кондиционер, теперь приходится переделывать.',
    neutralText:
      'Мастер был вежливый, но работа заняла больше времени, чем ожидалось.',
    type: 'service',
  },
  {
    positiveText:
      'Отличный сервис доставки, доставили вовремя и в хорошем состоянии.',
    negativeText: null,
    neutralText:
      'Товар был аккуратно упакован, но была небольшая задержка с доставкой.',
    type: 'service',
  },
  {
    positiveText: 'Очень стильная сумка, подходит для любых ситуаций.',
    negativeText: null,
    neutralText: 'Чуть меньше, чем я ожидал, но всё равно выглядит потрясающе.',
    type: 'product',
  },
  {
    positiveText:
      'Очень удобно с ними работать. Все сделано быстро и качественно.',
    negativeText: null,
    neutralText:
      'Мастера по ремонту техники работают быстро и с хорошим результатом.',
    type: 'service',
  },
  {
    positiveText: 'Магазин с отличным выбором аксессуаров для телефона.',
    negativeText: null,
    neutralText: 'Немного дороговато, но качество хорошее.',
    type: 'place',
  },
  {
    positiveText: 'Товар пришёл вовремя и в идеальном состоянии.',
    negativeText: null,
    neutralText: 'Немного дорого, но товар оправдал все ожидания.',
    type: 'product',
  },
  {
    positiveText: 'Очень уютное кафе, хорошее место для встреч с друзьями.',
    negativeText: null,
    neutralText:
      'Часто бывает много людей, но это не мешает общему впечатлению.',
    type: 'place',
  },
  {
    positiveText: null,
    negativeText:
      'Неудовлетворительное качество сборки мебели, пришлось немного доделывать.',
    neutralText: 'Мебель выглядит красиво, но не такая удобная, как ожидалось.',
    type: 'product',
  },
  {
    positiveText: 'Замечательные часы, очень удобные и выглядят элегантно.',
    negativeText: null,
    neutralText: 'Понравилось всё, кроме того, что циферблат легко царапается.',
    type: 'product',
  },
  {
    positiveText:
      'Отличный мастер по ремонту техники! Быстро выявил проблему и все исправил.',
    negativeText: null,
    neutralText: 'Доволен результатом, но пришлось немного подождать.',
    type: 'service',
  },
  {
    positiveText:
      'Место с прекрасным обслуживанием и вкусной едой, рекомендую.',
    negativeText: null,
    neutralText: 'Цены немного завышены, но это компенсируется качеством.',
    type: 'place',
  },
  {
    positiveText: null,
    negativeText: 'Ботинки оказались неудобными, быстро порвались.',
    neutralText:
      'Качество материалов оставляет желать лучшего, несмотря на хорошую цену.',
    type: 'product',
  },
  {
    positiveText:
      'Этот телевизор — просто находка! Отличное качество изображения.',
    negativeText: null,
    neutralText: 'Хотелось бы, чтобы звук был чуть громче, но в целом доволен.',
    type: 'product',
  },
  {
    positiveText: 'Супер сервис! Все сделали быстро и без проблем.',
    negativeText: null,
    neutralText:
      'Ремонт компьютера прошёл на высшем уровне, никаких нареканий.',
    type: 'service',
  },
  {
    positiveText: null,
    negativeText:
      'Магазин не предлагает возврат товаров, если вдруг не подошёл.',
    neutralText: 'Дороговато, но выбор интересный.',
    type: 'place',
  },
  {
    positiveText:
      'Удобный сервис для аренды велосипедов, все чисто и работает как нужно.',
    negativeText: null,
    neutralText: 'Небольшие проблемы с приложением, но в целом все устраивает.',
    type: 'service',
  },
  {
    positiveText:
      'Потрясающее качество наушников! Чистый звук, идеальные для музыки.',
    negativeText: null,
    neutralText: 'Чуть-чуть громковатый бас, но в целом — отличный товар.',
    type: 'product',
  },
];
